app/controllers/home_controller.rb

  def index
  	 @title = "Test application Graph"
         location_id = params[:location]
         days = params[:days]
         #render :text => days and return
         case days
			when "Week"
			  limit_rec = 7
			  #render :text => limit_rec and return
			when "Month"
			  limit_rec = 30
			when "3_Months"
			   limit_rec = 90
			when "Year"
				limit_rec = 365
			else
			  limit_rec = 7
			end
#render  :text => limit_rec and return
         if location_id.nil? || location_id == "Show_all_location "
         	@first_seventh = Receipt.all(:select => "date, sum(q_1) as q_1, sum(q_2) as q_2, sum(q_3) as q_3, sum(avg) as avg",:group => "date", :limit => "#{limit_rec}", :order => "id desc")
---
SELECT date, sum(q_1) as q_1, sum(q_2) as q_2, sum(q_3) as q_3, sum(avg) as avg FROM "receipts" WHERE (location_id = '102 ') GROUP BY date ORDER BY id desc LIMIT 7